/* --------------------------------------------------------------------- */
/* Code Structure                                                        */
/* --------------------------------------------------------------------- */

// 세미콜론 (semicolons)
console.log('다음 줄에서 코드를 작성 할 경우, 세미콜론을 붙인 것과 동일합니다.'); //? 줄 바꿈이 있다면 세미콜론(semicolon)을 생략할 수 있습니다.(암시적 세미콜론)
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권장합니다.');


// 한 줄 주석 (single line comment)
console.log('ECMAScript의 `문`은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다.');

/*
  여러 줄 (multi lines)
  주석 (comment)
*/

//! 중첩 주석은 지원하지 않는다.(주석을 중첩해서 쓰면 에러가 발생한다.)
//todo 주석은 스크립트 어느곳에서나 작성이 가능하고 주석으로인해 기능을 무시하고 실행에 영향을 주지 않는다.